
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/takahiro-impara/pd-iac/actions/runs/8701861343)



<pre><code>Apply complete! Resources: 13 added, 0 changed, 9 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.pagerduty_vendor.vendor: Reading...
pagerduty_team.pd_team["order-management"]: Refreshing state... [id=PWPNALU]
pagerduty_team.pd_team["shipping"]: Refreshing state... [id=PSCMA94]
pagerduty_team.pd_team["payment"]: Refreshing state... [id=PP3BZWE]
pagerduty_user.pd_user["imparapoc03@gmail.com"]: Refreshing state... [id=POCJ4A2]
data.pagerduty_vendor.vendor: Read complete after 1s [id=PAM4FGS]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["payment"]: Refreshing state... [id=POCJ4A2:PP3BZWE]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["order-management"]: Refreshing state... [id=POCJ4A2:PWPNALU]
pagerduty_escalation_policy.pd_esp["poc-order-management"]: Refreshing state... [id=P95T4LK]
pagerduty_escalation_policy.pd_esp["poc-payment"]: Refreshing state... [id=PPEE5BN]
pagerduty_service.pd_service["poc-payment"]: Refreshing state... [id=PHO8VLM]
pagerduty_service.pd_service["poc-order-management"]: Refreshing state... [id=PKKWWBP]
pagerduty_service_integration.datadog["poc-payment"]: Refreshing state... [id=PU5R7SE]
pagerduty_service_integration.datadog["poc-order-management"]: Refreshing state... [id=PXEC854]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.pagerduty_users.pd_users["bff"] will be read during apply
  # (config refers to values not yet known)
 <= data "pagerduty_users" "pd_users" {
      + id       = (known after apply)
      + team_ids = [
          + (known after apply),
        ]
      + users    = (known after apply)
    }

  # data.pagerduty_users.pd_users["cart"] will be read during apply
  # (config refers to values not yet known)
 <= data "pagerduty_users" "pd_users" {
      + id       = (known after apply)
      + team_ids = [
          + (known after apply),
        ]
      + users    = (known after apply)
    }

  # data.pagerduty_users.pd_users["order-management"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "pagerduty_users" "pd_users" {
      + id       = (known after apply)
      + team_ids = [
          + "PWPNALU",
        ]
      + users    = (known after apply)
    }

  # pagerduty_escalation_policy.pd_esp["bff"] will be created
  + resource "pagerduty_escalation_policy" "pd_esp" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "escalation-policy-bff"
      + num_loops   = 3
      + teams       = (known after apply)

      + rule {
          + escalation_delay_in_minutes = 10
          + id                          = (known after apply)

          + target {
              + id   = (known after apply)
              + type = "user_reference"
            }
        }
    }

  # pagerduty_escalation_policy.pd_esp["cart"] will be created
  + resource "pagerduty_escalation_policy" "pd_esp" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "escalation-policy-cart"
      + num_loops   = 3
      + teams       = (known after apply)

      + rule {
          + escalation_delay_in_minutes = 10
          + id                          = (known after apply)

          + target {
              + id   = (known after apply)
              + type = "user_reference"
            }
        }
    }

  # pagerduty_escalation_policy.pd_esp["order-management"] will be created
  + resource "pagerduty_escalation_policy" "pd_esp" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "escalation-policy-order-management"
      + num_loops   = 3
      + teams       = [
          + "PWPNALU",
        ]

      + rule {
          + escalation_delay_in_minutes = 10
          + id                          = (known after apply)

          + target {
              + id   = (known after apply)
              + type = "user_reference"
            }
        }
    }

  # pagerduty_escalation_policy.pd_esp["poc-order-management"] will be destroyed
  # (because key ["poc-order-management"] is not in for_each map)
  - resource "pagerduty_escalation_policy" "pd_esp" {
      - description = "Managed by Terraform" -> null
      - id          = "P95T4LK" -> null
      - name        = "escalation-policy-poc-order-management" -> null
      - num_loops   = 3 -> null
      - teams       = [
          - "PWPNALU",
        ] -> null

      - rule {
          - escalation_delay_in_minutes = 10 -> null
          - id                          = "PZNKXHE" -> null

          - escalation_rule_assignment_strategy {
              - type = "assign_to_everyone" -> null
            }

          - target {
              - id   = "POCJ4A2" -> null
              - type = "user_reference" -> null
            }
        }
    }

  # pagerduty_escalation_policy.pd_esp["poc-payment"] will be destroyed
  # (because key ["poc-payment"] is not in for_each map)
  - resource "pagerduty_escalation_policy" "pd_esp" {
      - description = "Managed by Terraform" -> null
      - id          = "PPEE5BN" -> null
      - name        = "escalation-policy-poc-payment" -> null
      - num_loops   = 3 -> null
      - teams       = [
          - "PP3BZWE",
        ] -> null

      - rule {
          - escalation_delay_in_minutes = 10 -> null
          - id                          = "PCK8YX4" -> null

          - escalation_rule_assignment_strategy {
              - type = "assign_to_everyone" -> null
            }

          - target {
              - id   = "POCJ4A2" -> null
              - type = "user_reference" -> null
            }
        }
    }

  # pagerduty_service.pd_service["bff"] will be created
  + resource "pagerduty_service" "pd_service" {
      + acknowledgement_timeout = "1200"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "86400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "bff"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + alert_grouping_parameters {
          + type = "intelligent"
        }

      + auto_pause_notifications_parameters {
          + enabled = true
          + timeout = 300
        }
    }

  # pagerduty_service.pd_service["cart"] will be created
  + resource "pagerduty_service" "pd_service" {
      + acknowledgement_timeout = "1200"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "86400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "cart"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + alert_grouping_parameters {
          + type = "intelligent"
        }

      + auto_pause_notifications_parameters {
          + enabled = true
          + timeout = 300
        }
    }

  # pagerduty_service.pd_service["order-management"] will be created
  + resource "pagerduty_service" "pd_service" {
      + acknowledgement_timeout = "1200"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "86400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "order-management"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + alert_grouping_parameters {
          + type = "intelligent"
        }

      + auto_pause_notifications_parameters {
          + enabled = true
          + timeout = 300
        }
    }

  # pagerduty_service.pd_service["poc-order-management"] will be destroyed
  # (because key ["poc-order-management"] is not in for_each map)
  - resource "pagerduty_service" "pd_service" {
      - acknowledgement_timeout = "1200" -> null
      - alert_creation          = "create_alerts_and_incidents" -> null
      - alert_grouping          = "intelligent" -> null
      - alert_grouping_timeout  = "null" -> null
      - auto_resolve_timeout    = "86400" -> null
      - created_at              = "2024-04-07T14:41:22+09:00" -> null
      - description             = "Managed by Terraform" -> null
      - escalation_policy       = "P95T4LK" -> null
      - html_url                = "https://fastretailing-staging.pagerduty.com/service-directory/PKKWWBP" -> null
      - id                      = "PKKWWBP" -> null
      - name                    = "poc-order-management" -> null
      - status                  = "active" -> null
      - type                    = "service" -> null

      - alert_grouping_parameters {
          - type = "intelligent" -> null

          - config {
              - fields      = [] -> null
              - time_window = 300 -> null
              - timeout     = 0 -> null
            }
        }

      - auto_pause_notifications_parameters {
          - enabled = true -> null
          - timeout = 300 -> null
        }

      - incident_urgency_rule {
          - type    = "constant" -> null
          - urgency = "high" -> null
        }
    }

  # pagerduty_service.pd_service["poc-payment"] will be destroyed
  # (because key ["poc-payment"] is not in for_each map)
  - resource "pagerduty_service" "pd_service" {
      - acknowledgement_timeout = "1200" -> null
      - alert_creation          = "create_alerts_and_incidents" -> null
      - alert_grouping          = "intelligent" -> null
      - alert_grouping_timeout  = "null" -> null
      - auto_resolve_timeout    = "86400" -> null
      - created_at              = "2024-04-07T14:41:22+09:00" -> null
      - description             = "Managed by Terraform" -> null
      - escalation_policy       = "PPEE5BN" -> null
      - html_url                = "https://fastretailing-staging.pagerduty.com/service-directory/PHO8VLM" -> null
      - id                      = "PHO8VLM" -> null
      - last_incident_timestamp = "2024-04-15T21:53:21+09:00" -> null
      - name                    = "poc-payment" -> null
      - status                  = "active" -> null
      - type                    = "service" -> null

      - alert_grouping_parameters {
          - type = "intelligent" -> null

          - config {
              - fields      = [] -> null
              - time_window = 300 -> null
              - timeout     = 0 -> null
            }
        }

      - auto_pause_notifications_parameters {
          - enabled = true -> null
          - timeout = 300 -> null
        }

      - incident_urgency_rule {
          - type    = "constant" -> null
          - urgency = "high" -> null
        }
    }

  # pagerduty_service_integration.datadog["bff"] will be created
  + resource "pagerduty_service_integration" "datadog" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "datadog-integration-bff"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PAM4FGS"
    }

  # pagerduty_service_integration.datadog["cart"] will be created
  + resource "pagerduty_service_integration" "datadog" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "datadog-integration-cart"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PAM4FGS"
    }

  # pagerduty_service_integration.datadog["order-management"] will be created
  + resource "pagerduty_service_integration" "datadog" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "datadog-integration-order-management"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PAM4FGS"
    }

  # pagerduty_service_integration.datadog["poc-order-management"] will be destroyed
  # (because key ["poc-order-management"] is not in for_each map)
  - resource "pagerduty_service_integration" "datadog" {
      - html_url        = "https://fastretailing-staging.pagerduty.com/services/PKKWWBP/integrations/PXEC854" -> null
      - id              = "PXEC854" -> null
      - integration_key = "a107c451562f4406d009897fd17ed7a9" -> null
      - name            = "datadog-integration-poc-order-management" -> null
      - service         = "PKKWWBP" -> null
      - type            = "generic_events_api_inbound_integration" -> null
      - vendor          = "PAM4FGS" -> null
    }

  # pagerduty_service_integration.datadog["poc-payment"] will be destroyed
  # (because key ["poc-payment"] is not in for_each map)
  - resource "pagerduty_service_integration" "datadog" {
      - html_url        = "https://fastretailing-staging.pagerduty.com/services/PHO8VLM/integrations/PU5R7SE" -> null
      - id              = "PU5R7SE" -> null
      - integration_key = "104f50d08c6b450dc0733ee3fe898582" -> null
      - name            = "datadog-integration-poc-payment" -> null
      - service         = "PHO8VLM" -> null
      - type            = "generic_events_api_inbound_integration" -> null
      - vendor          = "PAM4FGS" -> null
    }

  # pagerduty_team.pd_team["bff"] will be created
  + resource "pagerduty_team" "pd_team" {
      + default_role = (known after apply)
      + description  = "Managed by Terraform"
      + html_url     = (known after apply)
      + id           = (known after apply)
      + name         = "bff"
    }

  # pagerduty_team.pd_team["cart"] will be created
  + resource "pagerduty_team" "pd_team" {
      + default_role = (known after apply)
      + description  = "Managed by Terraform"
      + html_url     = (known after apply)
      + id           = (known after apply)
      + name         = "cart"
    }

  # pagerduty_team.pd_team["payment"] will be destroyed
  # (because key ["payment"] is not in for_each map)
  - resource "pagerduty_team" "pd_team" {
      - default_role = "manager" -> null
      - description  = "Managed by Terraform" -> null
      - html_url     = "https://fastretailing-staging.pagerduty.com/teams/PP3BZWE" -> null
      - id           = "PP3BZWE" -> null
      - name         = "payment" -> null
    }

  # pagerduty_team.pd_team["shipping"] will be destroyed
  # (because key ["shipping"] is not in for_each map)
  - resource "pagerduty_team" "pd_team" {
      - default_role = "manager" -> null
      - description  = "Managed by Terraform" -> null
      - html_url     = "https://fastretailing-staging.pagerduty.com/teams/PSCMA94" -> null
      - id           = "PSCMA94" -> null
      - name         = "shipping" -> null
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["bff"] will be created
  + resource "pagerduty_team_membership" "team_membership" {
      + id      = (known after apply)
      + role    = "manager"
      + team_id = (known after apply)
      + user_id = "POCJ4A2"
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["cart"] will be created
  + resource "pagerduty_team_membership" "team_membership" {
      + id      = (known after apply)
      + role    = "manager"
      + team_id = (known after apply)
      + user_id = "POCJ4A2"
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["payment"] will be destroyed
  # (because key ["payment"] is not in for_each map)
  - resource "pagerduty_team_membership" "team_membership" {
      - id      = "POCJ4A2:PP3BZWE" -> null
      - role    = "manager" -> null
      - team_id = "PP3BZWE" -> null
      - user_id = "POCJ4A2" -> null
    }

Plan: 13 to add, 0 to change, 9 to destroy.
pagerduty_service_integration.datadog["poc-order-management"]: Destroying... [id=PXEC854]
pagerduty_service_integration.datadog["poc-payment"]: Destroying... [id=PU5R7SE]
pagerduty_service_integration.datadog["poc-payment"]: Destruction complete after 0s
pagerduty_service_integration.datadog["poc-order-management"]: Destruction complete after 0s
pagerduty_service.pd_service["poc-order-management"]: Destroying... [id=PKKWWBP]
pagerduty_service.pd_service["poc-payment"]: Destroying... [id=PHO8VLM]
pagerduty_service.pd_service["poc-payment"]: Destruction complete after 2s
pagerduty_service.pd_service["poc-order-management"]: Destruction complete after 2s
pagerduty_escalation_policy.pd_esp["poc-payment"]: Destroying... [id=PPEE5BN]
pagerduty_escalation_policy.pd_esp["poc-order-management"]: Destroying... [id=P95T4LK]
pagerduty_escalation_policy.pd_esp["poc-payment"]: Destruction complete after 1s
pagerduty_escalation_policy.pd_esp["poc-order-management"]: Destruction complete after 1s
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["payment"]: Destroying... [id=POCJ4A2:PP3BZWE]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["payment"]: Destruction complete after 0s
pagerduty_team.pd_team["payment"]: Destroying... [id=PP3BZWE]
pagerduty_team.pd_team["shipping"]: Destroying... [id=PSCMA94]
pagerduty_team.pd_team["cart"]: Creating...
pagerduty_team.pd_team["bff"]: Creating...
pagerduty_team.pd_team["cart"]: Creation complete after 1s [id=PK6NBHR]
pagerduty_team.pd_team["bff"]: Creation complete after 1s [id=P1N1BX7]
pagerduty_team.pd_team["payment"]: Destruction complete after 2s
pagerduty_team.pd_team["shipping"]: Destruction complete after 2s
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["bff"]: Creating...
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["cart"]: Creating...
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["cart"]: Creation complete after 0s [id=POCJ4A2:PK6NBHR]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["bff"]: Creation complete after 0s [id=POCJ4A2:P1N1BX7]
data.pagerduty_users.pd_users["bff"]: Reading...
data.pagerduty_users.pd_users["cart"]: Reading...
data.pagerduty_users.pd_users["order-management"]: Reading...
data.pagerduty_users.pd_users["bff"]: Read complete after 0s [id=1713253661]
data.pagerduty_users.pd_users["cart"]: Read complete after 0s [id=1713253661]
data.pagerduty_users.pd_users["order-management"]: Read complete after 0s [id=1713253661]
pagerduty_escalation_policy.pd_esp["order-management"]: Creating...
pagerduty_escalation_policy.pd_esp["cart"]: Creating...
pagerduty_escalation_policy.pd_esp["bff"]: Creating...
pagerduty_escalation_policy.pd_esp["cart"]: Creation complete after 1s [id=PB4WFVL]
pagerduty_escalation_policy.pd_esp["order-management"]: Creation complete after 1s [id=PXV8EGY]
pagerduty_escalation_policy.pd_esp["bff"]: Creation complete after 1s [id=P9AOCCV]
pagerduty_service.pd_service["order-management"]: Creating...
pagerduty_service.pd_service["bff"]: Creating...
pagerduty_service.pd_service["cart"]: Creating...
pagerduty_service.pd_service["order-management"]: Creation complete after 0s [id=POYPCED]
pagerduty_service.pd_service["bff"]: Creation complete after 0s [id=P7M1C2Q]
pagerduty_service.pd_service["cart"]: Creation complete after 0s [id=P4PDBQ0]
pagerduty_service_integration.datadog["order-management"]: Creating...
pagerduty_service_integration.datadog["cart"]: Creating...
pagerduty_service_integration.datadog["bff"]: Creating...
pagerduty_service_integration.datadog["cart"]: Creation complete after 1s [id=PQORNV8]
pagerduty_service_integration.datadog["bff"]: Creation complete after 1s [id=P9C39FI]
pagerduty_service_integration.datadog["order-management"]: Creation complete after 1s [id=P62F93V]

Apply complete! Resources: 13 added, 0 changed, 9 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":14,"Program":"tfcmt","SHA1":"6e14b6fd7059412fce8dc86eaeee21008f9e2d46","Vars":{},"WorkflowName":"Apply Terraform"} -->